{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Courage_Under_Fire born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Courage_Under_Fire dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Bernard_McEveety?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Bernard_McEveety .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of The_Terrorist_(1998_film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_Terrorist_(1998_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed The_Dead_Sleep_Easy?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_Dead_Sleep_Easy dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which books were written by Mary_L._Trump?", "context": "Schema: Book --author--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?book WHERE {\n  ?book dbo:author dbr:Mary_L._Trump .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Thumb_Wars.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Thumb_Wars dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Playful_Pan.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Playful_Pan dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Middle_of_Nowhere_(2012_film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Middle_of_Nowhere_(2012_film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Francis_of_Assisi_(film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Francis_of_Assisi_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Irving_Cummings?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Irving_Cummings .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by H._B._Halicki?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:H._B._Halicki .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the director of Dangerous_Touch born?", "context": "Schema: Film --director--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Dangerous_Touch dbo:director ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Don_Jon__Don_Jon__1 born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Don_Jon__Don_Jon__1 dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed They_Were_Five?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:They_Were_Five dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Sam_Newfield?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Sam_Newfield .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of I'm_Not_There born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:I'm_Not_There dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of His_Birthright.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:His_Birthright dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Matthew_Bright?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Matthew_Bright .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Half_of_It born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Half_of_It dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Big_Hit born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Big_Hit dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Heidi_(2005_live-action_film)__Heidi__1?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Heidi_(2005_live-action_film)__Heidi__1 dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Georgy_Natanson?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Georgy_Natanson .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Baby_Islam?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Baby_Islam .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Strike_Up_the_Band_(film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Strike_Up_the_Band_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Killer_of_Sheep?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Killer_of_Sheep dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Just_Add_Water_(film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Just_Add_Water_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which books were written by John_Fortune?", "context": "Schema: Book --author--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?book WHERE {\n  ?book dbo:author dbr:John_Fortune .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Titanic_(1997_film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Titanic_(1997_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Night_Stalker_(2016_film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Night_Stalker_(2016_film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Freedomland_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Freedomland_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Suburbicon born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Suburbicon dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Psycho_(1998_film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Psycho_(1998_film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Conduct_Zero.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Conduct_Zero dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Dogwalker born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Dogwalker dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Non-Stop_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Non-Stop_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Padauk_Pinle?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Padauk_Pinle dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Lost_World:_Jurassic_Park born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Lost_World:_Jurassic_Park dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Stanley_Donen?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Stanley_Donen .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Route_666_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Route_666_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Sprinter_(film)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Sprinter_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed The_Orange_Girl?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_Orange_Girl dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Texas_to_Bataan.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Texas_to_Bataan dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Richard_Eyre?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Richard_Eyre .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Stand_and_Deliver born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Stand_and_Deliver dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Bats_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Bats_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by John_Gilbert_(actor)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:John_Gilbert_(actor) .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of After_the_Wedding_(2019_film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:After_the_Wedding_(2019_film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Phantom_Thunderbolt?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Phantom_Thunderbolt dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed The_Sultan_of_Johore?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_Sultan_of_Johore dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Terror_Express?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Terror_Express dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of The_Mad_Bomberg_(1932_film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_Mad_Bomberg_(1932_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Tales_from_the_Darkside:_The_Movie born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Tales_from_the_Darkside:_The_Movie dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Tyler_Perry?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Tyler_Perry .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by John_Sacret_Young?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:John_Sacret_Young .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Woman_in_the_Window_(2021_film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Woman_in_the_Window_(2021_film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of George_Reddy_(film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:George_Reddy_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Mangal_Pandey:_The_Rising?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Mangal_Pandey:_The_Rising dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Frontier_Outpost?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Frontier_Outpost dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Harry_L._Franklin?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Harry_L._Franklin .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Venus_in_Evening_Wear?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Venus_in_Evening_Wear dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Oorummadi_Brathukulu.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Oorummadi_Brathukulu dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Nagathihalli_Chandrashekhar?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Nagathihalli_Chandrashekhar .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of El_heredero_de_Casa_Pruna.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:El_heredero_de_Casa_Pruna dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Boogie_Nights born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Boogie_Nights dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Split_Second_(1953_film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Split_Second_(1953_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of World_Traveler born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:World_Traveler dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed C.S.A.:_The_Confederate_States_of_America?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:C.S.A.:_The_Confederate_States_of_America dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Alibaba_Aradajanu_Dongalu.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Alibaba_Aradajanu_Dongalu dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Shadow_of_the_Wolf born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Shadow_of_the_Wolf dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by N._Sankaran_Nair?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:N._Sankaran_Nair .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Shape_of_the_Moon.", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Shape_of_the_Moon dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Calling_Homicide?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Calling_Homicide dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Asterix:_The_Secret_of_the_Magic_Potion?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Asterix:_The_Secret_of_the_Magic_Potion dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Second_Chances_(film)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Second_Chances_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of The_She-Wolf_(1965_film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_She-Wolf_(1965_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed I_Love_You_Too_(2001_film)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:I_Love_You_Too_(2001_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Loving_Annabelle born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Loving_Annabelle dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Created_Equal_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Created_Equal_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Padauk_Musical?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Padauk_Musical dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Philippe_Garrel?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Philippe_Garrel .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Snapshot_(film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Snapshot_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Wonderstruck_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Wonderstruck_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who wrote Follow_the_Rabbit-Proof_Fence?", "context": "Schema: Book --author--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Follow_the_Rabbit-Proof_Fence dbo:author ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Tigers_(2014_film)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Tigers_(2014_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Death_of_a_President_(2006_film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Death_of_a_President_(2006_film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Robert_McKimson?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Robert_McKimson .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Name the director of Idealist_(film).", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Idealist_(film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Guess_Who_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Guess_Who_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
