{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Chup_Chup_Ke?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Chup_Chup_Ke dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Being_Flynn born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Being_Flynn dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of The_Hunger_Games:_Mockingjay__Part_1 born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:The_Hunger_Games:_Mockingjay__Part_1 dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed The_Best_of_Enemies_(1961_film)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:The_Best_of_Enemies_(1961_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Marie_and_Bruce born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Marie_and_Bruce dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Who directed Sharada_(1957_film)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?person WHERE {\n  dbr:Sharada_(1957_film) dbo:director ?person .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Which films were directed by Paul_Verhoeven_(German_director)?", "context": "Schema: Film --director--> Person", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?film WHERE {\n  ?film dbo:director dbr:Paul_Verhoeven_(German_director) .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of Savage_Grace born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Savage_Grace dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the starring actor of A_Map_of_the_World_(film) born?", "context": "Schema: Film --starring--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:A_Map_of_the_World_(film) dbo:starring ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
{"instruction": "Translate the question into a SPARQL query.", "input": "Where was the director of Skills_like_This born?", "context": "Schema: Film --director--> Person --birthPlace--> Place", "output": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbr: <http://dbpedia.org/resource/>\nSELECT ?answer WHERE {\n  dbr:Skills_like_This dbo:director ?mid .\n  ?mid dbo:birthPlace ?answer .\n}"}
